БухЭксп/Documents/CW_ПоступлениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ПоступлениеТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегШин</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегТС</xr:Item>
				<xr:Item>InformationRegister.CW_ПоказанияОдометровТранспортныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТранспортныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробегСГрузом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТопливоКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеТранспортногоСредства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_СостоянияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробегПорожний</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПутевыхЛистов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспортногоСредства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШиныТранспортногоСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановкиШины</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_МестаУстановкиШинТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_ПоступлениеТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ВедетсяУчетШинТранспортногоСредства 	= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	ДанныеДляПроведения 					= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	СтуктураУстанавилваемыхПараметров 		= CW_УчетСобственногоТранспортаСервер.ПолучитьУстанавливаемыеПараметры();
	
	Для Каждого СтрокаДок из СписокТранспортныхСредств Цикл
		
		//----
		//СостояниеТС
		СтрокаСостояния = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
		СтрокаСостояния.Период = Дата;
		СтрокаСостояния.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
		СтрокаСостояния.Состояние 				= СтрокаДок.СостояниеТранспортногоСредства;
		
		//----
		//ПараметрыТС
		Для Каждого ЭлементСтркутуры из СтуктураУстанавилваемыхПараметров Цикл
			СтрокаПараметрыТС = ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
			СтрокаПараметрыТС.Период 						= Дата;
			СтрокаПараметрыТС.ТранспортноеСредство 			= СтрокаДок.ТранспортноеСредство;
			СтрокаПараметрыТС.ПараметрТранпортногоСредства 	= ЭлементСтркутуры.Значение;
			
			Если ЭлементСтркутуры.Ключ = "Организация" Тогда
				ЗначениеПараметра = Организация;
			Иначе
				ЗначениеПараметра = СтрокаДок[ЭлементСтркутуры.Ключ];
			КонецЕсли;
			
			СтрокаПараметрыТС.Значение 	= ЗначениеПараметра;
			
		КонецЦикла;
		
		//----
		//ПробегТС
		Если  (СтрокаДок.Пробег <> 0) или   (СтрокаДок.ПробегСГрузом <> 0) Тогда 
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПробегТС.Добавить();
			СтрокаПробегТС.Период 					= Дата;
			СтрокаПробегТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаПробегТС.Пробег 					= СтрокаДок.Пробег;
			СтрокаПробегТС.ПробегСГрузом 			= СтрокаДок.ПробегСГрузом;
		КонецЕсли;
		//----
		//ПробегТС
		Если  (СтрокаДок.Пробег <> 0) Тогда 
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПоказанияОдометровТранспортныхСредств.Добавить();
			СтрокаПробегТС.Период 					= Дата;
			СтрокаПробегТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаПробегТС.Пробег 					= СтрокаДок.Пробег;
		КонецЕсли;
		
		//ТопливоТС
		Если  (СтрокаДок.ТопливоКоличество <> 0) Тогда 
			СтрокаТопливоТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
			СтрокаТопливоТС.Период 					= Дата;
			СтрокаТопливоТС.ВидДвижения 			= ВидДвиженияНакопления.Приход;
			СтрокаТопливоТС.Организация 			= Организация;
			СтрокаТопливоТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаТопливоТС.Топливо 				= СтрокаДок.ТранспортноеСредство.ОсновноеТопливо;
			СтрокаТопливоТС.Количество 				= СтрокаДок.ТопливоКоличество;
		КонецЕсли;
		
	КонецЦикла;
	
	// ---
	Если ВедетсяУчетШинТранспортногоСредства Тогда
	
		Для каждого СтрокаШин из ШиныТранспортногоСредства Цикл
			
			СтрокаСостояния = ДанныеДляПроведения.CW_ШиныТС.Добавить();
			СтрокаСостояния.Период = Дата;
			СтрокаСостояния.ТранспортноеСредство 	= СтрокаШин.ТранспортноеСредство;
			СтрокаСостояния.МестоУстановкиШины 		= СтрокаШин.МестоУстановкиШины;
			СтрокаСостояния.Шина 					= СтрокаШин.Шина;
			
			Если СтрокаШин.Пробег <> 0 Тогда
				СтрокаСостояния = ДанныеДляПроведения.CW_ПробегШин.Добавить();
				СтрокаСостояния.Период = Дата;
				СтрокаСостояния.Шина 					= СтрокаШин.Шина;
				СтрокаСостояния.ТранспортноеСредство 	= СтрокаШин.ТранспортноеСредство;
				СтрокаСостояния.Пробег 					= СтрокаШин.Пробег;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// ---	
	
	Возврат ДанныеДляПроведения;
	
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

#КонецЕсли
